{"pc_cookie-policy_banner_ok":{"value":"OK","description":"\"Okay\" label to accept something"},"pc_cookie_banner_privacy_policy_link":{"value":"privacy policy","description":"The title of the link for privacy policy"},"pc_cookie_banner_text":{"value":"We use cookies in order to optimize our website and continually improve it. By continuing to use this site, you are agreeing to our use of cookies. You can find more information on cookies in our <a data-test=\"privacy-banner-settings-link\" target=\"_blank\" rel=\"noopener noreferrer\" href=\"{privacyPolicyUrl}\">{privacyPolicyText}</a>.","description":"The text used for the cookie banner"},"pc_cookie_error_dialog_okay":{"value":"Okay","description":"The localized text for the Okay button in the error cookie dialog"},"pc_cookie_error_dialog_title":{"value":"Service Error","description":"Error dialog title"},"pc_cookie_error_text_confirm_preferences":{"value":"Error: Please make a selection","description":"Error message that is displayed when user selects “Confirm Choices” without selecting radio buttons."},"pc_cookie_error_text_guest_mode":{"value":"Something went wrong, please refresh the page and try again.","description":"Error message that is displayed If the cookie is blank and there's a GET error."},"pc_cookie_error_text_save_permissions":{"value":"Oops, something went wrong! Please try again.","description":"Error message that is displayed when member permissions cannot be saved back to UPS."},"pc_cookie_error_text_settings_fails":{"value":"Sorry, we couldn't process your request. We're working to fix the error. Please try again later.","description":"Error message occurred to the user while the settings page was not loaded."},"pc_cookie_error_text_settings_update":{"value":"An error occurred before your changes were saved. Please try again.","description":"Error message that is displayed when a user tries to change privacy settings."},"pc_cookie_label_privacy_policy":{"value":"Privacy & Cookie Policy","description":"Privacy and Cookies Policy"},"pc_cookie_policy_banner_ok":{"value":"OK","description":"The localized text for the OK button in the cookie banner"},"pc_cookie_settings_label":{"value":"Cookie Settings","description":"Cookie Settings label"},"pc_cookie_text_accept":{"value":"Accept","description":"Text when user accepts the cookie conditions"},"pc_cookie_text_cancel":{"value":"Cancel","description":"Cancel cookie button text"},"pc_cookie_text_footer":{"value":"You can always change your preference by visiting \"Cookie Settings\" at the bottom of the page. View <a data-test=\"privacy-policy-settings-link\" target=\"_blank\" rel=\"noopener noreferrer\" href=\"{privacyPolicyUrl}\">{privacyPolicyText}</a> for full details.","description":"The text used for the cookie modals footer"},"pc_cookie_text_functional":{"value":"These cookies are required for basic site functionality and are therefore always enabled. These include cookies that allow you to be remembered as you explore the site within a single session or, if you request, from session to session. They help make the shopping cart and checkout process possible as well as assist in security issues and conforming to regulations.","description":"Text description of the functional purpose of cookies"},"pc_cookie_text_more_information":{"value":"More Information","description":"Text for more information"},"pc_cookie_text_performance":{"value":"These cookies allow us to improve the site’s functionality by tracking usage on this website. In some cases these cookies improve the speed with which we can process your request, allow us to remember site preferences you’ve selected. De-selecting these cookies may result in poorly-tailored recommendations and slow site performance.","description":"Text description for cookie performance"},"pc_cookie_text_policy":{"value":"Nike asks you to accept cookies for performance, social media and advertising purposes. Social media and advertising cookies of third parties are used to offer you social media functionalities and personalized ads. To get more information or amend your preferences, press the ‘more information’ button or visit \"Cookie Settings\" at the bottom of the website. To get more information about these cookies and the processing of your personal data, check our {privacyAndCookiePolicyHTML}. Do you accept these cookies and the processing of personal data involved?\n","description":"The main text used for the cookie modal agreement"},"pc_cookie_text_save":{"value":"Save","description":"Save cookie button text"},"pc_cookie_text_social":{"value":"Social media cookies offer the possibility to connect you to your social networks and share content from our website through social media. Advertising cookies (of third parties) collect information to help better tailor advertising to your interests, both within and beyond Nike websites. In some cases, these cookies involve the processing of your personal data. For more information about this processing of personal data, check our {privacyAndCookiePolicyHTML}. De-selecting these cookies may result in seeing advertising that is not as relevant to you or you not being able to link effectively with Facebook, Twitter, or other social networks and/or not allowing you to share content on social media.","description":"The text describing what social media cookies are used for"},"pc_inline_cookie_back":{"value":"Back","description":"Text for learn more back button"}}
